app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    @article.update(params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-05-08 21:08:03.408650"], ["id", 1]]